// responses.js

const responses = {
    'ipc 1': `विवरण - भारतीय दंड संहिता की धारा 1 के अनुसार यह अधिनियम भारतीय दण्ड संहिता कहलाएगा |

    ध्यान दें - 5 अगस्त 2019 से पहले आईपीसी जम्मू-कश्मीर पर लागू नहीं होता था। बल्कि रणबीर दंड संहिता जम्मू-कश्मीर राज्य पर लागू थी।
    लेकिन, 5 अगस्त 2019 को भारतीय संविधान में संशोधन के बाद, भारतीय संविधान के अनुच्छेद 370 के तहत जम्मू और कश्मीर की विशेष स्थिति को हटा दिया गया है। इसलिए, आईपीसी जम्मू-कश्मीर सहित पूरे भारत में लागू है।`,

    'ipc 2': `प्रत्येक व्यक्ति [विदेशी + भारतीय] जो भारत देश के अंदर कोई अपराध करता है, उसे भारतीय कानून भारतीय दंड संहिता (IPC) के अनुसार ही सजा मिलेगी। यह धारा अदालत को यह अधिकार प्रदान करती है कि उसके ऊपर अदालत में मुकदमा चलाया जाए।`,

    'ipc 3': `कोई भी भारतीय नागरिक भारत देश के बाहर जाकर कोई ऐसा काम करता है जिसे उस देश में अपराध नहीं माना जाए, लेकिन भारतीय कानून के अनुसार वह अपराध हो, तो भारत में वापस आने पर उसे भारतीय कानून IPC के अनुसार ही सजा मिलेगी।`,

    'ipc 4': `कोई भी भारतीय नागरिक अगर भारत देश में पंजीकृत कोई भी वहाँ (जो कि भारतीय सीमा से बाहर है) पर अगर कोई अपराध करता है, तो उसे भारतीय कानून के हिसाब से ही दंड दिया जाएगा।`,

    'ipc 302': `शीर्षक: हत्या
    सजा: मौत या जीवन के लिए कारावास + धन
    ज्ञाता: ज्ञातीय
    जमानत: अजमानीय
    अदालती: सत्र की अदालत`,

    'ipc 304A': `शीर्षक: लापरवाही से मौत का कारण
    सजा: दो साल तक कारावास या धन या दोनों
    ज्ञाता: ज्ञातीय
    जमानत: जमानती
    अदालती: किसी भी मजिस्ट्रेट`,

    'ipc 306': `शीर्षक: आत्महत्या का उकसान
    सजा: 10 वर्षों तक कारावास + धन
    ज्ञाता: ज्ञातीय
    जमानत: जमानती
    अदालती: सत्र की अदालत`,

    'ipc 354': `शीर्षक: महिला की मर्यादा को उल्लंघन या गुंडागर्दी के साथ हमला
    सजा: 2 वर्षों तक कारावास या धन या दोनों
    ज्ञाता: ज्ञातीय
    जमानत: जमानती
    अदालती: पहले श्रेणी के मजिस्ट्रेट`,

    'ipc 376': `शीर्षक: बलात्कार के लिए सजा
    सजा: 7 वर्षों से कम नहीं लेकिन जो जीवन के लिए हो सकती है या जो 10 वर्षों तक बढ़ सकती है + धन
    ज्ञाता: ज्ञातीय
    जमानत: अजमानीय
    अदालती: सत्र की अदालत`,

    'default': 'क्षमा करें, मुझे यह समझ नहीं आया।'
};

module.exports = responses;
